{
    "Identifier" : "CMM",
    "Domain" : "Memory Management",
    "Name" : "Customizable Memory Management",
    "Description" : "conservative garbage collector for C++ developed for PoSSo (Polynomial System Solver) project",
    "Keywords" : ["Garbage Collector", "Memory Management"],
    "Date of creation" : "08/27/1994",
    "Date of publication" : "08/26/1995",
    "Project" : "PoSSo (Polynomial System Solver)",
    "Programming language" : "c++",
    "Code Repository" : "https://github.com/Unipisa/CMM",
    "Platform/OS" : "SunOS 4.x, Solaris 2.x, Linux 1.x, 2.x, AIX (RS6000), SGI, Win32 (Windows 95, Windows NT), Digital OS (Alpha), MacOS (Metrowerks C++)",
    "Software requirements" : ["g++"],
    "Version" : "1.9",
    "Developement status" : "Unsupported",
    "License" : "Copyright (C) 1993 Tito Flagella.\nThis file is part of the POSSO Customizable Memory Manager (CMM).\nPermission to use, copy, and modify this software and its documentation is\nhereby granted only under the following terms and conditions.  Both the\nabove copyright notice and this permission notice must appear in all copies\nof the software, derivative works or modified versions, and any portions\nthereof, and both notices must appear in supporting documentation.\nUsers of this software agree to the terms and conditions set forth herein,\nand agree to license at no charge to all parties under these terms and\nconditions any derivative works or modified versions of this software.\n\nThis software may be distributed (but not offered for sale or transferred\nfor compensation) to third parties, provided such third parties agree to\nabide by the terms and conditions of this notice.  \n\nTHE SOFTWARE IS PROVIDED \"AS IS\" AND THE COPYRIGHT HOLDERS DISCLAIM ALL\nWARRANTIES WITH REGARD TO THIS SOFTWARE, INCLUDING ALL IMPLIED WARRANTIES OF\nMERCHANTABILITY AND FITNESS.   IN NO EVENT SHALL THE COPYRIGHT HOLDERS\nBE LIABLE FOR ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR\nANY DAMAGES WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER\nIN AN ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT\nOF OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.",
    "Authors" : ["Giuseppe Attardi", "Tito Flagella", "Pietro Iglio" ],
    "Developers" : ["Carlo Traverso", "Christian Heckler", "Hans J. Boehm", "Joachim Hollman", "John Abbott", "Patrick C. Beard", "Uttam M. Narsu" ],
    "Affiliation" : "Dipartimento di Informatica, Università di Pisa",
    "Related links" : ["https://doi.org/10.1006/jsco.1996.0013"]
}